
## Plan Result (terraform/aws/longhorn)

[CI link](https://github.com/boxp/arch/actions/runs/21544412635)


### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 8 to add, 0 to change, 1 to destroy.</code></pre>

* Create
  * aws_iam_group.longhorn_backup
  * aws_iam_group_membership.longhorn_backup
  * aws_iam_group_policy_attachment.longhorn_backup
  * aws_iam_policy.longhorn_backup
  * aws_s3_bucket.longhorn_backup_logs
  * aws_s3_bucket_logging.longhorn_backup
  * aws_s3_bucket_public_access_block.longhorn_backup_logs
  * aws_s3_bucket_server_side_encryption_configuration.longhorn_backup_logs
* Delete
  * aws_iam_user_policy.longhorn_backup


<details><summary>Change Result (Click me)</summary>

```hcl

  # aws_iam_group.longhorn_backup will be created
  + resource "aws_iam_group" "longhorn_backup" {
      + arn       = (known after apply)
      + id        = (known after apply)
      + name      = "longhorn-backup-group"
      + path      = "/system/"
      + unique_id = (known after apply)
    }

  # aws_iam_group_membership.longhorn_backup will be created
  + resource "aws_iam_group_membership" "longhorn_backup" {
      + group = "longhorn-backup-group"
      + id    = (known after apply)
      + name  = "longhorn-backup-membership"
      + users = [
          + "longhorn-backup-user",
        ]
    }

  # aws_iam_group_policy_attachment.longhorn_backup will be created
  + resource "aws_iam_group_policy_attachment" "longhorn_backup" {
      + group      = "longhorn-backup-group"
      + id         = (known after apply)
      + policy_arn = (known after apply)
    }

  # aws_iam_policy.longhorn_backup will be created
  + resource "aws_iam_policy" "longhorn_backup" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "longhorn-backup-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::boxp-longhorn-backup"
                    },
                  + {
                      + Action   = [
                          + "s3:GetObject",
                          + "s3:PutObject",
                          + "s3:DeleteObject",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:s3:::boxp-longhorn-backup/*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # aws_iam_user_policy.longhorn_backup will be destroyed
  # (because aws_iam_user_policy.longhorn_backup is not in configuration)
  - resource "aws_iam_user_policy" "longhorn_backup" {
      - id          = "longhorn-backup-user:longhorn-backup-policy" -> null
      - name        = "longhorn-backup-policy" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:ListBucket",
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::boxp-longhorn-backup"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:PutObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::boxp-longhorn-backup/*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - user        = "longhorn-backup-user" -> null
        # (1 unchanged attribute hidden)
    }

  # aws_s3_bucket.longhorn_backup_logs will be created
  + resource "aws_s3_bucket" "longhorn_backup_logs" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "boxp-longhorn-backup-logs"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_region               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = "ap-northeast-1"
      + request_payer               = (known after apply)
      + tags_all                    = (known after apply)
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)

      + cors_rule (known after apply)

      + grant (known after apply)

      + lifecycle_rule (known after apply)

      + logging (known after apply)

      + object_lock_configuration (known after apply)

      + replication_configuration (known after apply)

      + server_side_encryption_configuration (known after apply)

      + versioning (known after apply)

      + website (known after apply)
    }

  # aws_s3_bucket_logging.longhorn_backup will be created
  + resource "aws_s3_bucket_logging" "longhorn_backup" {
      + bucket        = "boxp-longhorn-backup"
      + id            = (known after apply)
      + region        = "ap-northeast-1"
      + target_bucket = (known after apply)
      + target_prefix = "access-logs/"
    }

  # aws_s3_bucket_public_access_block.longhorn_backup_logs will be created
  + resource "aws_s3_bucket_public_access_block" "longhorn_backup_logs" {
      + block_public_acls       = true
      + block_public_policy     = true
      + bucket                  = (known after apply)
      + id                      = (known after apply)
      + ignore_public_acls      = true
      + region                  = "ap-northeast-1"
      + restrict_public_buckets = true
    }

  # aws_s3_bucket_server_side_encryption_configuration.longhorn_backup_logs will be created
  + resource "aws_s3_bucket_server_side_encryption_configuration" "longhorn_backup_logs" {
      + bucket = (known after apply)
      + id     = (known after apply)
      + region = "ap-northeast-1"

      + rule {
          + blocked_encryption_types = []

          + apply_server_side_encryption_by_default {
              + sse_algorithm     = "AES256"
                # (1 unchanged attribute hidden)
            }
        }
    }

Plan: 8 to add, 0 to change, 1 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","JobName":"plan","PRNumber":6462,"Program":"tfcmt","SHA1":"206eef6aaffb924ae50f5481602140a7e0f6a29b","Target":"terraform/aws/longhorn","Vars":{},"WorkflowName":"pull_request_target"} -->